test_rus = [
    {
        'correct': 'B',
        'image': 'test_ru/q1.png',
        'options': [
            'A) 24266',
            'B) 24260',
            'C) 24261',
            'D) 24259'
        ],
        'question': 'Вопрос по математике 1) Найдите сумму двух чисел.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q2.png',
        'options': [
            'A) 46300462',
            'B) 463004623',
            'C) 463004622',
            'D) 4630046220'
        ],
        'question': 'Вопрос по математике 2) Найдите сумму трёх чисел.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q3.png',
        'options': [
            'A) 0',
            'B) 5',
            'C) -5',
            'D) -4'
        ],
        'question': 'Вопрос по математике 3) Найдите разницу между двумя числами.'
    },
    {
        'correct': 'A',
        'image': 'test_ru/q4.png',
        'options': [
            'A) 25761',
            'B) -25761',
            'C) 25760',
            'D) 25762'
        ],
        'question': 'Вопрос по математике 4) Найдите разницу между двумя числами.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q5.png',
        'options': [
            'A) 23',
            'B) 1',
            'C) -23',
            'D) 0'
        ],
        'question': 'Вопрос по математике 5) Найдите произведение двух чисел.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q6.png',
        'options': [
            'A) -12',
            'B) 6',
            'C) 3',
            'D) 12'
        ],
        'question': 'Вопрос по математике 6) Найдите произведение двух чисел.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q7.png',
        'options': [
            'A) 170',
            'B) 120',
            'C) 180',
            'D) 150'
        ],
        'question': 'Вопрос по математике 7) Найдите произведение двух чисел.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q8.png',
        'options': [
            'A) 2',
            'B) 0.25',
            'C) 0.5',
            'D) 1'
        ],
        'question': 'Вопрос по математике 8) Найдите результат деления.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q9.png',
        'options': [
            'A) Ошибка!',
            'B) 0',
            'C) 1',
            'D) 625'
        ],
        'question': 'Вопрос по математике 9) Найдите результат деления.'
    },
    {
        'correct': 'A',
        'image': 'test_ru/q10.png',
        'options': [
            'A) 5837620',
            'B) 583762',
            'C) 837620',
            'D) 5837640'
        ],
        'question': 'Вопрос по математике 10) Найдите результат деления.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q11.png',
        'options': [
            'A) 48',
            'B) 49',
            'C) 50',
            'D) 49.85'
        ],
        'question': 'Вопрос по математике 11) Найдите результат деления.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q12.png',
        'options': [
            'A) -180',
            'B) -30',
            'C) 180',
            'D) 30'
        ],
        'question': 'Вопрос по математике 12) Решите следующее выражение.'
    },
    {
        'correct': 'A',
        'image': 'test_ru/q13.png',
        'options': [
            'A) -11',
            'B) 11',
            'C) -29',
            'D) -9'
        ],
        'question': 'Вопрос по математике 13) Решите следующее выражение.'
    },
    {
        'correct': 'A',
        'image': 'test_ru/q14.png',
        'options': [
            'A) -216',
            'B) 216',
            'C) 18',
            'D) -18'
        ],
        'question': 'Вопрос по математике 14) Решите пример.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q15.png',
        'options': [
            'A) 80',
            'B) 83',
            'C) 85',
            'D) 89'
        ],
        'question': 'Вопрос по математике 15) Решите следующее выражение.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q16.png',
        'options': [
            'A) Х = 0',
            'B) Х = -3',
            'C) Х = 3',
            'D) Х = 1'
        ],
        'question': 'Вопрос по математике 16) Решите уравнение.'
    },
    {
        'correct': 'A',
        'image': 'test_ru/q17.png',
        'options': [
            'A) 12%',
            'B) 0.12%',
            'C) 16%',
            'D) 27%'
        ],
        'question': 'Вопрос по логике 17) Решите задачу.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q18.png',
        'options': [
            'A) Само число',
            'B) 1',
            'C) 0',
            'D) -1'
        ],
        'question': 'Вопрос по логике 18) Решите задачу.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q19.png',
        'options': [
            'A) Яблоко тяжелее',
            'B) Груша тяжелее',
            'C) Вес одинаковый',
            'D) Ошибка'
        ],
        'question': 'Вопрос по логике 19) Решите задачу.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q20.png',
        'options': [
            'A) 216',
            'B) 202',
            'C) 218',
            'D) 116'
        ],
        'question': 'Вопрос по логике 20) Решите задачу.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q21.png',
        'options': [
            'A) 35 кг и 35 кг',
            'B) 34 кг и 36 кг',
            'C) 33 кг и 37 кг',
            'D) 32 кг и 38 кг'
        ],
        'question': 'Вопрос по логике 21) Решите задачу.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q22.png',
        'options': [
            'A) 48 минут',
            'B) 36 минут',
            'C) 16 минут',
            'D) 40 минут'
        ],
        'question': 'Вопрос по логике 22) Решите задачу.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q23.png',
        'options': [
            'A) 3дм; 6см; 200000г; 5дм; 8см; 250000г',
            'B) 5дм; 4см; 25000г; 7дм; 6см; 30000г',
            'C) 4дм; 5см; 250000г; 6дм; 7см; 300000г',
            'D) 6дм; 7см; 300000г; 4дм; 5см; 200000г'
        ],
        'question': 'Вопрос по логике 23) Решите выражение.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q24.png',
        'options': [
            'A) 3дм; 6см; 200000г;\nдм; 8см; 250000г',
            'B) 5дм; 4см; 25000г;\n7дм; 6см; 30000г',
            'C) 4дм; 5см; 250000г;\n6дм; 7см; 300000г',
            'D) 6дм; 7см; 300000г;\n4дм; 5см; 200000г'
        ],
        'question': 'Вопрос по логике 24) Решите задачу.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q25.png',
        'options': [
            'A) 6',
            'B) 7',
            'C) 10',
            'D) 8'
        ],
        'question': 'Вопрос по логике 25) Решите задачу.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q26.png',
        'options': [
            'A) >; <; <; >; <',
            'B) <; <; >; >; >',
            'C) >; =; <; <; <',
            'D) =; >; <; >; ='
        ],
        'question': 'Вопрос по логике 26) Сравните числа.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q27.png',
        'options': [
            'A) 150 см',
            'B) 120 см',
            'C) 140 см',
            'D) 130 см'
        ],
        'question': 'Вопрос по логике 27) Решите задачу.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q28.png',
        'options': [
            'A) 10 пар, 14 одиночных',
            'B) 14 пар, 10 одиночных',
            'C) 12 пар, 12 одиночных',
            'D) 11 пар, 13 одиночных'
        ],
        'question': 'Вопрос по логике 28) Решите задачу.'
    },
    {
        'correct': 'A',
        'image': 'test_ru/q29.png',
        'options': [
            'A) 999; 9999; 99999; 999999',
            'B) 100; 1000; 10000; 100000',
            'C) 999; 9999; 9999; 99999',
            'D) 998; 9998; 99998; 999998'
        ],
        'question': 'Вопрос по логике 29) Решите задачу.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q30.png',
        'options': [
            'A) 5',
            'B) 8',
            'C) 6',
            'D) 7'
        ],
        'question': 'Вопрос по логике 30) Решите задачу.'
    },
    {
        'correct': 'C',
        'image': 'test_ru/q31.png',
        'options': [
            'A) 52',
            'B) 53',
            'C) 54',
            'D) 55'
        ],
        'question': 'Вопрос по логике 31) Решите задачу.'
    },
    {
        'correct':  'D',
        'image' : 'test_ru/q32.png',
        'options': [
            'A) 1',
            'B) 99',
            'C) 999',
            'D) 900'
        ],
        'question': 'Вопрос по логике 32) Решите задачу.'
    },
    {
        'correct': 'B',
        'image': 'test_ru/q33.png',
        'options': [
            'A) 6,  7,  12',
            'B) 7,  6,  11',
            'C) 5,  8,  13',
            'D) 8,  5,  10'
        ],
        'question': 'Вопрос по логике 33) Решите задачу.'
    },
    {
        'correct': 'D',
        'image': 'test_ru/q34.png',
        'options': [
            'A) 22',
            'B) 19',
            'C) 20',
            'D) 21'
        ],
        'question': 'Вопрос по логике 34) Решите задачу.'
    },
]