test_tjk = [
    {
        'correct': 'B',
        'image': 'test_tj/q1.png',
        'options': [
            'A) 24266',
            'B) 24260',
            'C) 24261',
            'D) 24259'
        ],
        'question': 'Саволи математика 1) Суммаи ду ададро ёбед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q2.png',
        'options': [
            'A) 46300462',
            'B) 463004623',
            'C) 463004622',
            'D) 4630046220'
        ],
        'question': 'Саволи математика 2)  Суммаи се ададро ёбед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q3.png',
        'options': [
            'A) 0',
            'B) 5',
            'C) -5',
            'D) -4'
        ],
        'question': 'Саволи математика 3) Фарқи байни ду ададро ёбед.'
    },
    {
        'correct': 'A',
        'image': 'test_tj/q4.png',
        'options': [
            'A) 25761',
            'B) -25761',
            'C) 25760',
            'D) 25762'
        ],
        'question': 'Саволи математика 4) Фарқи байни ду ададро ёбед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q5.png',
        'options': [
            'A) 23',
            'B) 1',
            'C) -23',
            'D) 0'
        ],
        'question': 'Саволи математика 5) Ҳосили зарби ду ададро ёбед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q6.png',
        'options': [
            'A) -12',
            'B) 6',
            'C) 3',
            'D) 12'
        ],
        'question': 'Саволи математика 6) Ҳосили зарби ду ададро ёбед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q7.png',
        'options': [
            'A) 170',
            'B) 120',
            'C) 180',
            'D) 150'
        ],
        'question': 'Саволи математика 7) Ҳосили зарби ду ададро ёбед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q8.png',
        'options': [
            'A) 2',
            'B) 0,25',
            'C) 0,5',
            'D) 1'
        ],
        'question': 'Саволи математика 8) Ҳосили тақсимро ёбед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q9.png',
        'options': [
            'A) Иштибоҳ!',
            'B) 0',
            'C) 1',
            'D) 625'
        ],
        'question': 'Саволи математика 9) Ҳосили тақсимро ёбед.'
    },
    {
        'correct': 'A',
        'image': 'test_tj/q10.png',
        'options': [
            'A) 5837620',
            'B) 583762',
            'C) 837620',
            'D) 5837640'
        ],
        'question': 'Саволи математика 10) Ҳосили тақсимро ёбед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q11.png',
        'options': [
            'A) 48',
            'B) 49',
            'C) 50',
            'D) 49,85'
        ],
        'question': 'Саволи математика 11) Ҳосили тақсимро ёбед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q12.png',
        'options': [
            'A) -180',
            'B) -30',
            'C) 180',
            'D) 30'
        ],
        'question': 'Саволи математика 12) Амалиёти зеринро ҳал кунед.'
    },
    {
        'correct': 'A',
        'image': 'test_tj/q13.png',
        'options': [
            'A) -11',
            'B) 11',
            'C) -29',
            'D) -9'
        ],
        'question': 'Саволи математика 13) Амалиёти зеринро ҳал кунед.'
    },
    {
        'correct': 'A',
        'image': 'test_tj/q14.png',
        'options': [
            'A) -216',
            'B) 216',
            'C) 18',
            'D) -18'
        ],
        'question': 'Саволи математика 14) Мисоли зеринро ҳал кунед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q15.png',
        'options': [
            'A) 80',
            'B) 83',
            'C) 85',
            'D) 89'
        ],
        'question': 'Саволи математика 15) Амалиёти зеринро ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q16.png',
        'options': [
            'A) Х = 0',
            'B) Х = -3',
            'C) Х = 3',
            'D) Х = 1'
        ],
        'question': 'Саволи математика 16) Муодилаи зуринҳо ҳал кунед.'
    },
    {
        'correct': 'A',
        'image': 'test_tj/q17.png',
        'options': [
            'A) 12%',
            'B) 0,12%',
            'C) 16%',
            'D) 27%'
        ],
        'question': 'Саволи мантиқӣ 17) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q18.png',
        'options': [
            'A) Худи адад',
            'B) 1',
            'C) 0',
            'D) -1'
        ],
        'question': 'Саволи мантиқӣ 18) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q19.png',
        'options': [
            'A) Себ вазнин аст',
            'B) Нок вазнин аст',
            'C) Вазн баробар аст',
            'D) Иштибоҳ'
        ],
        'question': 'Саволи мантиқӣ 19) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q20.png',
        'options': [
            'A) 216',
            'B) 202',
            'C) 218',
            'D) 116'
        ],
        'question': 'Саволи мантиқӣ 20) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q21.png',
        'options': [
            'A) 35 кг ва 35 кг',
            'B) 34 кг ва 36 кг',
            'C) 33 кг ва 37 кг',
            'D) 32 кг ва 38 кг'
        ],
        'question': 'Саволи мантиқӣ 21) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q22.png',
        'options': [
            'A) 48 дақиқа',
            'B) 36 дақиқа',
            'C) 16 дақиқа',
            'D) 40 дақиқа'
        ],
        'question': 'Саволи мантиқӣ 22) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q23.png',
        'options': [
            'A) 3дм; 6см; 200000г;\nдм; 8см; 250000г',
            'B) 5дм; 4см; 25000г;\n7дм; 6см; 30000г',
            'C) 4дм; 5см; 250000г;\n6дм; 7см; 300000г',
            'D) 6дм; 7см; 300000г;\n4дм; 5см; 200000г'
        ],
        'question': 'Саволи мантиқӣ 23) Ифодаро ҳал кунед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q24.png',
        'options': [
            'A) 1121 км',
            'B) 921 км',
            'C) 1373 км',
            'D) 1921 км'
        ],
        'question': 'Саволи мантиқӣ 24) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q25.png',
        'options': [
            'A) 6',
            'B) 7',
            'C) 10',
            'D) 8'
        ],
        'question': 'Саволи мантиқӣ 25) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q26.png',
        'options': [
            'A) >; <; <; >; <',
            'B) <; <; >; >; >',
            'C) >; =; <; <; <',
            'D) =; >; <; >; ='
        ],
        'question': 'Саволи мантиқӣ 26) Ададҳоро муқоиса кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q27.png',
        'options': [
            'A) 150 см',
            'B) 120 см',
            'C) 140 см',
            'D) 130 см'
        ],
        'question': 'Саволи мантиқӣ 27) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q28.png',
        'options': [
            'A) 10 ҷуфт, 14 тоқ',
            'B) 14 ҷуфт, 10 тоқ',
            'C) 12 ҷуфт, 12 тоқ ',
            'D) 11 ҷуфт, 13 тоқ'
        ],
        'question': 'Саволи мантиқӣ 28) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'A',
        'image': 'test_tj/q29.png',
        'options': [
            'A) 999; 9999; 99999; 999999',
            'B) 100; 1000; 10000; 100000',
            'C) 999; 9999; 9999; 99999',
            'D) 998; 9998; 99998; 999998'
        ],
        'question': 'Саволи мантиқӣ 29) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q30.png',
        'options': [
            'A) 5',
            'B) 8',
            'C) 6',
            'D) 7'
        ],
        'question': 'Саволи мантиқӣ 30) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'C',
        'image': 'test_tj/q31.png',
        'options': [
            'A) 52',
            'B) 53',
            'C) 54',
            'D) 55'
        ],
        'question': 'Саволи мантиқӣ 31) Масъаларо ҳал кунед.'
    },
    {
        'correct':  'D',
        'image' : 'test_tj/q32.png',
        'options': [
            'A) 1',
            'B) 99',
            'C) 999',
            'D) 900'
        ],
        'question': 'Вопрос по логике 32)  Масъаларо ҳал кунед.'
    },
    {
        'correct': 'B',
        'image': 'test_tj/q33.png',
        'options': [
            'A) 6,  7,  12',
            'B) 7,  6,  11',
            'C) 5,  8,  13',
            'D) 8,  5,  10'
        ],
        'question': 'Саволи мантиқӣ 33) Масъаларо ҳал кунед.'
    },
    {
        'correct': 'D',
        'image': 'test_tj/q34.png',
        'options': [
            'A) 22',
            'B) 19',
            'C) 20',
            'D) 21'
        ],
        'question': 'Саволи мантиқӣ 34) Масъаларо ҳал кунед.'
    },
]